WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_SMPR2);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_SMPR2);

  //------------------------------------------------------------
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions. If there are no entries then nothing will be converted.
  // Basically, which input is connected to the ADC in which order.
  //
  // The values put in these fields can be found by looking at the target
  // hardware. For the FeatherV2, A00 is PA4. Next look at the Data Sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  //
  // ADC_SQR3 contains the first 6, ADC_SQR2 the next 6 and ADC_SQR1 the last 4
  // for a total of 16 GPIOs can be connected to ADC1
  uint32_t adcInputChan;
  uint32_t seqRegCount;
  uint32_t remainingCnt = _gpioCount;
  uint32_t regCnt;

  seqRegCount = MEADOW_ADC_SEQ_REGISTER_3_TOTAL;
  if(remainingCnt < MEADOW_ADC_SEQ_REGISTER_3_TOTAL)
    seqRegCount = remainingCnt;

  regval = getreg32(STM32_ADC1_SQR3);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  for(regCnt = 0; regCnt < seqRegCount; regCnt++)
  {
    // For entry x what ADC input value does it have
    adcInputChan = get_in_chan_from_pinid(regCnt);
    regval |= (adcInputChan << (ADC_SQR3_SQ1_SHIFT + (regCnt * 5)));
  }
  putreg32(regval, STM32_ADC1_SQR3);
  remainingCnt -= MEADOW_ADC_SEQ_REGISTER_3_TOTAL;

  // Need to do 2nd sequence register?
  if(remainingCnt > 0)
  {
    seqRegCount = MEADOW_ADC_SEQ_REGISTER_2_TOTAL;
    if(remainingCnt < MEADOW_ADC_SEQ_REGISTER_2_TOTAL)
      seqRegCount = remainingCnt;
    
    regval = getreg32(STM32_ADC1_SQR2);
    regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
    for(regCnt = 0; regCnt < seqRegCount; regCnt++)
    {
      // For entry x what ADC input value does it have
      adcInputChan = get_in_chan_from_pinid(regCnt);
      regval |= (adcInputChan << (ADC_SQR2_SQ7_SHIFT + (regCnt * 5)));
    }
    putreg32(regval, STM32_ADC1_SQR2);
    remainingCnt -= MEADOW_ADC_SEQ_REGISTER_2_TOTAL;

    // Need to do 3rd sequence register?
    if(remainingCnt > 0)
    {
      // Must do the last sequence register also
      seqRegCount = MEADOW_ADC_SEQ_REGISTER_1_TOTAL;
      if(remainingCnt < MEADOW_ADC_SEQ_REGISTER_1_TOTAL)
        seqRegCount = remainingCnt;

      regval = getreg32(STM32_ADC1_SQR1);
      regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
      for(regCnt = 0; regCnt < seqRegCount; regCnt++)
      {
        // For entry x what ADC input value does it have
        adcInputChan = get_in_chan_from_pinid(regCnt);
        regval |= (adcInputChan << (ADC_SQR1_SQ13_SHIFT + (regCnt * 5)));
      }
      putreg32(regval, STM32_ADC1_SQR1);
    }
  }

  // Last set the size
  regval = getreg32(STM32_ADC1_SQR1);
  regval |= ((_gpioCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_SQR1);

//---------------------------------------------------------
  // (--) WHY NOT WITH OTHER CR2 CONFIGS?
  // Enable DMA of ADC
  regval = getreg32(STM32_ADC1_CR2);
  // DDS may only be for single ADC mode  (may be only when not using sequence???)
  // but comments 15.8.1 ony double buffered circular mode
  regval |= ADC_CR2_DDS;          // 1=Enable DMA Disable Selection
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  regval |= ADC_CR2_CONT;         // 1=Enable continuous mode
  putreg32(regval, STM32_ADC1_CR2);
}

//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_CR2);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_CR2);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;
  
  // Clear ADC Status register
  regval  = getreg32(STM32_ADC1_SR);
  regval = 0;
  putreg32(regval, STM32_ADC1_SR);

  // Start conversion
  regval  = getreg32(STM32_ADC1_CR2);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_CR2);
}

//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

  // Using Nuttx DMA module to handle DMA setup

  // if(_dmaHandle != NULL)
  // {
  //   // Needed only if previous dma being modified.
  //   stm32_dmastop(_dmaHandle);
  //   stm32_dmafree(_dmaHandle); 
  // }
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval =  DMA_SCR_MSIZE_16BITS;   // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_CIRC;           // Circular mode 1=enabled
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // For double-buffered add DMA_SCR_DBM to regval, the second buffer must be
  // follow the first in memory, so a double sized buffer is needed.
  // Internal to stm32_dmasetup() it sets the second buffer memory addr
  // based on the address of the one supplied + the buffer size.
  regval |= DMA_SCR_DBM;            // Double buffered mode
#endif

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_DR,                     // Peripheral data addr
                 (uint32_t)_dmaDataBuffer1,         // Memory addr
                 ADC_TESTS_DMA_DATA_BUFFER_SIZE,    // number of transfers
                 regval);

  // Provide DMA callback
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// Configure
// OPTION gpioList could require an 0xff terminator instead of gpioCount
// As few as 1 GPIO with 1 buffer slot and as many as 16 GPIO with 
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          uint16_t dataBuffer[], uint32_t bufferSize)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff;

