WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  _gpioCount = gpioCount;

  // Must have at least 1 entry per gpio
  if(gpioCount < bufferSize)
  {
    return -EINVAL;   // Invalid argument
  }

  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for match
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        continue;   // Found-it's connected to ADC
      
      // gpioList contains a GPIO not connected to ADC
      return -EINVAL;   // Invalid argument
    }
  }

  // Will the number of GPIOs exactly fill the provided buffer?
  if(gpioCount % bufferSize != 0)
  {
    // Warning
  }

  // Only after conversion has finished
  sem_init(&_waitTillDoneSem, 0, 1);

  adc_initialize();

  adc_enable();

  dma_initialize();

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
  }

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  return OK;
}

//=========================================================
// Convert
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_fill_buffer(void)
{
  // Start conversion
  adc_start();

  // Wait for conversion to finish
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

  return OK;
}



